# 计算机5部分：
# 控制部分：CPU
# 运算部分： CPU|GPU
# 存储部分：内存(Memory) | 外存-硬盘
# 输入设备：Input
# 输出设备：Output
## I/O ： 就是我们常说的 输入输出

# 操作系统：
# 计算机说到底 就是一堆零件 这些零件收到软件的支配 如果我们要实现 一个视频的播放，应该是软件去控制硬件实现播放
# 第一步就是要有一个最基础的控制程序
# 第二步就是 软件 调用控制程序，控制程序调用计算机硬件
# 软件就是 应用程序
# 控制程序十分复杂，需要十分深厚的计算机底层逻辑理念，如果仅仅是为了播放一个视频，就苦学数十载才完成第一步，成本太大
# 所以 站在巨人的肩膀上， 现在的操作系统 就是控制程序
# 操作系统 是集成 计算机的各种部分，使其达成协作 的 控制程序


# 编程就是 人类控制计算机 让计算机实现特定步骤
# Python是一种编程语言，也就是 人类与计算机沟通的语言
# Python是 解释性语言 -- 因为这一特性 导致运行效率相对 编译型的相对较慢


# 跨平台：
# 跨平台就是在不同的操作系统上控制计算机的硬件
# 不同的操作系统，会有相同的地方，也会有不同的地方
# 不同的地方，我们应该使用不同的方法实现相同的效果，但是Python支持跨平台
# 就是在不同的平台上，相同的代码，可以实现相同的效果。
# 不会因为操作系统的特性，导致无法达到想要的效果
